package com.yonsai.network;

import java.sql.Connection;

public class Main {

	public static void main(String[] args) {
		// 네트워크?
		//  - 떨어져있는 두 프로그램이 데이터를 주고 받는 것!
		//  카카오톡앱 - 카카오톡본사
		//  컴포즈커피앱(수원) - 거북시장 앞 (장안) 모니터(아메리카노주문)
		//  키오스크 - 주방모니터(햄버거주문 들어왔다)
		//  게임에 전체대화창(전세계) - 나 (서울)
		//  수원 - 네이버 (판교) 로그인
		
		// 네트워크를 사용할 때 딱! 3가지
		// 1. IP = 컴퓨터 주소!
		//     인터넷에서 어느 컴퓨터를 찾아갈지 알려주는 주소!
		//     경기도 화성시 동탄순환대로 서희스타힐스(건물주소)
		
		// 2. Port = 프로그램을 찾아가는 문 번호
		//       21동 101호(몇 호실)
		//    한 컴퓨터에는 여러 프로그램이 실행되고 있으니 포트번호
		
		// 192.168.82.100컴퓨터의 5000번 문으로 찾아가!
		
		// 3. Socket - 두 프로그램이 데이터를 주고 받을 수 있도록
		//             만들어진 연결 통로!
		
		// 도메인?
		//  - 사람이 외우는 주소! IP는 컴퓨터가 찾아가는 주소!
		// 실무에서는 네이버,카카오,구글  고정된 ip하나를 쓰지 않는다.
		// 서버가(데이터를 제공하는 컴퓨터) 여러대가 된다.
		// 사용자 위치에 따라서 가장 가까운 서버로 연결시켜줌(CDN)
		// 접속할 때마다 지역마다 다른 IP가 올 수있다.
		
		// 집에가셔서 메뉴 - 돋보기 - 명령 프롬프트 
		//  > nslookup www.naver.com
		new NetworkTest()			//자바객체 생성해!
			.아이피주소알아내기();		// 그리고 ip알아내
		
		
		// IP - 어느 컴퓨터야?
		// Port - 그 컴퓨터의 어떤 프로그램이야?
		// Socket - IP+ Port를 이용해서 프로그램끼리 데이터를 주고받는
		//       통신연결
		
		
		
	}
}
