import java.util.Scanner;

public class ScannerTest {

	public static void main(String[] args) {
		
		// 1. 키보드 생성
		Scanner 키보드 = new Scanner(System.in);
		
		// 나이 입력
		// println() 괄호안에 있는 값을 콘솔에 출력하고 
		//           자동으로 줄바꿈 해라!
		// print() 괄호안에 있는 값을 콘솔에 출력만 한다
		System.out.print("나이를 입력:");
		int age = 키보드.nextInt();
						// 20\n
		// 키보드로 입력한 값중에 필요없는 내용들을 지운다.
		// 자판기에서 거스름돈을 반환받고 자판기는 0원
		// 식판에 음식을 받아서 모두 먹는것! 식판 깨끗이 비운다
		// 입력버퍼(후반 입력 출력 수업)
		// 숫자를 입력하고 나서 문자를 입력받으려면 
		// 기존에 남아있는 불필요한 문자들을 싹 지워야된다.
		// 안그러면 다음 입력을 받을 때 버그가 생긴다.
		키보드.nextLine();
		
		System.out.println("이름을 입력:");
		String name =  키보드.nextLine();
		
		System.out.println("----사람의 정보-----");
		System.out.println("이름: "+ name);
		System.out.println("나이: " + age);
		
		// 오늘 교안 없습니다. 
		// 수업한 내용을 정리해서 노션에 올려놓겠습니다. 
		// 지금 부터 실습시간! (정리)
		// 만약 실습을 하고 싶으면 SwordBattleGame 파일에 
		//  아이템 구매하기를 추가해서 아이템을 구매해서 내가 장착할 
		//  아이템을 선택해서 싸우기!
		//  검 - 한번 때리면 50점 감소
		//  창 -          100점 감소
		//  낫 -          500점 감소 
		
		//  슬라임 - 총 목숨 100점
		//  고블린 -       200점
		//  드래곤 -       500점
		
		// 검(50원) 창(100원) 낫 (500원) 구매금액
		// 소지금 1000원! 기본 세팅하시면 됩니다!
		// 가방.add("검"); 지우기!
		
		// 1. 아이템구매 하는 코드를 작성
		// 2. 가방에서 어떤 아이템을 선택할지 
		// 3. 싸우기!
		
		
	}
}






